[{"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "AI Is Helping Scientists Discover Fresh Craters on Mars", "preview": "It's the first time machine learning has been used to find previously unknown craters on the Red Planet."}, {"title": "Join NASA for the Launch of the Mars 2020 Perseverance Rover", "preview": "No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."}, {"title": "NASA's Perseverance Rover Is Midway to Mars ", "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "NASA's Perseverance Rover Mission Getting in Shape for Launch", "preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet. "}, {"title": "From JPL's Mailroom to Mars and Beyond", "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title": "Global Storms on Mars Launch Dust Towers Into the Sky", "preview": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert", "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."}, {"title": "Sensors on Mars 2020 Spacecraft Answer Long-Distance Call From Earth", "preview": "Instruments tailored to collect data during the descent of NASA's next rover through the Red Planet's atmosphere have been checked in flight."}]