[{"title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter", "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "The Man Who Wanted to Fly on Mars", "preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "Alabama High School Student Names NASA's Mars Helicopter", "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"title": "The MarCO Mission Comes to an End", "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."}, {"title": "New Selfie Shows Curiosity, the Mars Chemist", "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."}, {"title": "NASA InSight's 'Mole' Is Out of Sight", "preview": "Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "NASA Invites Public to Share Excitement of Mars 2020 Perseverance Rover Launch", "preview": "There are lots of ways to participate in the historic event, which is targeted for July 30."}, {"title": "Meet the People Behind NASA's Perseverance Rover", "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}]